export const formFields = [
  {
    header: "Выберите тип вашего учреждения из списка ниже",
    type: "radio",
    name: "type",
    options: ["Санаторий", "Детский оздоровительный лагерь", "Дом отдыха", "Реабилитационный центр"],
  },
  {
    header: "Выберите тип отдыхающих",
    type: "radio",
    name: "people",
    options: ["Взрослые", "Дети", "Все вместе"],
  },
  {
    header: "Выберите возраст детей",
    type: "radio",
    name: "age",
    options: ["1-2 года", "4-7 лет", "8-11 лет", "12-18 лет"],
    showIf: (formData) => formData.people === "Дети" || formData.people === "Все вместе",
  },
  {
    header: "Выберите диету",
    type: "radio",
    name: "food_group",
    options: ["Обычный стол без диеты", "Диетический стол №1", "Диетический стол №2", "Диетический стол №3"],
  },
  {
    header: "Выберите блюда, которые вы хотите видеть в меню",
    type: "checkbox",
    name: "menu",
    blocks: [
      {
        category: "kasha",
        items: ["Перловая", "Геркулес", "Манная", "Гречневая"]
      },
      {
        category: "snacks",
        items: ["Паштет печоночный", "Белужья зернистая", "Кеты зернистая", "Фасоль консервы"]
      },
      {
        category: "drinks",
        items: ["Кофе", "Чай", "Сок", "Вода"]
      },
    ]
  }
];
